src/openforms/registrations/contrib/stuf_zds/tests/files/vcr_cassettes/StufZDSPluginPartnersComponentVCRTests/test_create_zaak_with_hidden_partners.yaml

interactions:
- request:
    body: '{"type": "RaadpleegMetBurgerservicenummer", "burgerservicenummer": ["000009830"],
      "fields": ["partners.burgerservicenummer", "partners.naam.voornamen", "partners.naam.voorletters",
      "partners.naam.voorvoegsel", "partners.naam.geslachtsnaam", "partners.geboorte.datum"]}'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate, br
      Authorization:
      - Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiIiLCJpYXQiOjE3NTU2MTI3MTcsImV4cCI6MTc1NTY1NTkxNywiY2xpZW50X2lkIjoiIiwidXNlcl9pZCI6IiIsInVzZXJfcmVwcmVzZW50YXRpb24iOiIifQ.-ZtyBwM6-wRTPst0oK7AUyylYsm0JKwQz5RxCvc6XPs
      Connection:
      - keep-alive
      Content-Length:
      - '268'
      Content-Type:
      - application/json; charset=utf-8
      User-Agent:
      - python-requests/2.32.4
      x-doelbinding:
      - ''
      x-gebruiker:
      - BurgerZelf
      x-origin-oin:
      - ''
      x-verwerking:
      - ''
    method: POST
    uri: http://localhost:5010/haalcentraal/api/brp/personen
  response:
    body:
      string: '{"type":"RaadpleegMetBurgerservicenummer","personen":[{"partners":[]}]}'
    headers:
      Content-Length:
      - '71'
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Tue, 19 Aug 2025 14:11:57 GMT
      Server:
      - Kestrel
    status:
      code: 200
      message: OK
- request:
    body: "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<soapenv:Envelope\n    xmlns:soapenv=\"http://www.w3.org/2003/05/soap-envelope\"\n
      \   xmlns:StUF=\"http://www.egem.nl/StUF/StUF0301\"\n    xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\n>\n
      \   <soapenv:Header>\n        \n\n    </soapenv:Header>\n    <soapenv:Body>\n
      \       \n\n<ZKN:zakLk01\n    xmlns:ZKN=\"http://www.egem.nl/StUF/sector/zkn/0310\"\n
      \   xmlns:BG=\"http://www.egem.nl/StUF/sector/bg/0310\"\n    xmlns:GML=\"http://www.opengis.net/gml\"\n>\n
      \   <ZKN:stuurgegevens>\n        <StUF:berichtcode>Lk01</StUF:berichtcode>\n
      \       <StUF:zender>\n    <StUF:organisatie>zender_organisatie-1</StUF:organisatie>\n<StUF:applicatie>zender_applicatie-1</StUF:applicatie>\n<StUF:administratie>zender_administratie-1</StUF:administratie>\n<StUF:gebruiker>zender_gebruiker-1</StUF:gebruiker>\n\n</StUF:zender>\n<StUF:ontvanger>\n
      \   <StUF:organisatie>ontvanger_organisatie-1</StUF:organisatie>\n<StUF:applicatie>ontvanger_applicatie-1</StUF:applicatie>\n<StUF:administratie>ontvanger_administratie-1</StUF:administratie>\n<StUF:gebruiker>ontvanger_gebruiker-1</StUF:gebruiker>\n\n</StUF:ontvanger>\n<StUF:referentienummer>06f61636-baab-4d4c-b3f5-72c84e197165</StUF:referentienummer>\n<StUF:tijdstipBericht>20250819141157</StUF:tijdstipBericht>\n\n
      \       <StUF:entiteittype>ZAK</StUF:entiteittype>\n    </ZKN:stuurgegevens>\n
      \   <ZKN:parameters>\n        <StUF:mutatiesoort>T</StUF:mutatiesoort>\n        <StUF:indicatorOvername>V</StUF:indicatorOvername>\n
      \   </ZKN:parameters>\n    <ZKN:object StUF:verwerkingssoort=\"T\" StUF:entiteittype=\"ZAK\">\n
      \       <ZKN:identificatie>abc999</ZKN:identificatie>\n        \n            <ZKN:omschrijving>my-form</ZKN:omschrijving>\n
      \       \n        \n        \n        <ZKN:startdatum>20250819</ZKN:startdatum>\n
      \       <ZKN:registratiedatum>20250819</ZKN:registratiedatum>\n        <ZKN:betalingsIndicatie>N.v.t.</ZKN:betalingsIndicatie>\n
      \       \n\n        <ZKN:zaakniveau>1</ZKN:zaakniveau>\n        <ZKN:deelzakenIndicatie>N</ZKN:deelzakenIndicatie>\n
      \       <StUF:tijdstipRegistratie>20250819141157</StUF:tijdstipRegistratie>\n
      \       <StUF:extraElementen>\n\n<StUF:extraElement naam=\"language_code\">en</StUF:extraElement>\n\n</StUF:extraElementen>\n\n\n
      \       <ZKN:isVan StUF:entiteittype=\"ZAKZKT\" StUF:verwerkingssoort=\"T\">\n
      \           <ZKN:gerelateerde StUF:verwerkingssoort=\"I\" StUF:entiteittype=\"ZKT\">\n
      \               \n                <ZKN:code>foo</ZKN:code>\n                <ZKN:ingangsdatumObject>20250819</ZKN:ingangsdatumObject>\n
      \           </ZKN:gerelateerde>\n        </ZKN:isVan>\n        \n            <ZKN:heeftAlsInitiator
      StUF:verwerkingssoort=\"T\" StUF:entiteittype=\"ZAKBTRINI\">\n                <ZKN:gerelateerde>\n
      \                   \n                    \n                        <ZKN:natuurlijkPersoon
      StUF:entiteittype=\"NPS\" StUF:verwerkingssoort=\"T\">\n                            \n
      \                               <BG:inp.bsn>000009830</BG:inp.bsn>\n                                <BG:authentiek
      StUF:metagegeven=\"true\">J</BG:authentiek>\n                            \n
      \                           \n                            \n                            \n
      \                           \n                            \n                            \n\n
      \                           \n                        </ZKN:natuurlijkPersoon>\n
      \                   \n                </ZKN:gerelateerde>\n                <StUF:tijdstipRegistratie>20250819141157</StUF:tijdstipRegistratie>\n
      \           </ZKN:heeftAlsInitiator>\n        \n        \n        \n        \n\n
      \       \n    </ZKN:object>\n</ZKN:zakLk01>\n    </soapenv:Body>\n</soapenv:Envelope>\n"
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate, br
      Connection:
      - keep-alive
      Content-Length:
      - '3552'
      Content-Type:
      - application/soap+xml
      SOAPAction:
      - http://www.egem.nl/StUF/sector/zkn/0310/creeerZaak_Lk01
      User-Agent:
      - python-requests/2.32.4
    method: POST
    uri: http://localhost/stuf-zds
  response:
    body:
      string: "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<soapenv:Envelope xmlns:soapenv=\"http://www.w3.org/2003/05/soap-envelope\">\n
        \   <soapenv:Header/>\n    <soapenv:Body>\n        <StUF:Bv03Bericht xmlns:StUF=\"http://www.egem.nl/StUF/StUF0301\"\n
        \                         xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\n
        \                         xsi:schemaLocation=\"http://www.egem.nl/StUF/StUF0301
        stuf0301.xsd\">\n            <StUF:stuurgegevens>\n                <StUF:berichtcode>Bv03</StUF:berichtcode>\n
        \               <StUF:zender>\n                    <StUF:organisatie>KING</StUF:organisatie>\n
        \                   <StUF:applicatie>STP</StUF:applicatie>\n                    <StUF:gebruiker/>\n
        \               </StUF:zender>\n                <StUF:ontvanger>\n                    <StUF:organisatie>ORG</StUF:organisatie>\n
        \                   <StUF:applicatie>TTA</StUF:applicatie>\n                    <StUF:gebruiker/>\n
        \               </StUF:ontvanger>\n                <!-- NOTE: these mock values
        are meaningless -->\n                <StUF:referentienummer>7771605337</StUF:referentienummer>\n
        \               <StUF:tijdstipBericht>20210520125824</StUF:tijdstipBericht>\n
        \               <StUF:crossRefnummer>abeab17b-03cb-477b-95af-410f07947f40</StUF:crossRefnummer>\n
        \           </StUF:stuurgegevens>\n        </StUF:Bv03Bericht>\n    </soapenv:Body>\n</soapenv:Envelope>"
    headers:
      Connection:
      - close
      Content-Length:
      - '1349'
      Content-Type:
      - text/xml
      Date:
      - Tue, 19 Aug 2025 14:11:57 GMT
      Server:
      - Werkzeug/3.1.3 Python/3.12.11
    status:
      code: 200
      message: OK
- request:
    body: "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<soapenv:Envelope\n    xmlns:soapenv=\"http://www.w3.org/2003/05/soap-envelope\"\n
      \   xmlns:StUF=\"http://www.egem.nl/StUF/StUF0301\"\n    xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\n>\n
      \   <soapenv:Header>\n        \n\n    </soapenv:Header>\n    <soapenv:Body>\n
      \       \n\n<ZKN:genereerDocumentIdentificatie_Di02 xmlns:ZKN=\"http://www.egem.nl/StUF/sector/zkn/0310\">\n
      \   <ZKN:stuurgegevens>\n        <StUF:berichtcode>Di02</StUF:berichtcode>\n
      \       <StUF:zender>\n    <StUF:organisatie>zender_organisatie-1</StUF:organisatie>\n<StUF:applicatie>zender_applicatie-1</StUF:applicatie>\n<StUF:administratie>zender_administratie-1</StUF:administratie>\n<StUF:gebruiker>zender_gebruiker-1</StUF:gebruiker>\n\n</StUF:zender>\n<StUF:ontvanger>\n
      \   <StUF:organisatie>ontvanger_organisatie-1</StUF:organisatie>\n<StUF:applicatie>ontvanger_applicatie-1</StUF:applicatie>\n<StUF:administratie>ontvanger_administratie-1</StUF:administratie>\n<StUF:gebruiker>ontvanger_gebruiker-1</StUF:gebruiker>\n\n</StUF:ontvanger>\n<StUF:referentienummer>6bc61e59-12f6-45c1-91c5-c4e08bb8270e</StUF:referentienummer>\n<StUF:tijdstipBericht>20250819141157</StUF:tijdstipBericht>\n\n
      \       <StUF:functie>genereerDocumentidentificatie</StUF:functie>\n    </ZKN:stuurgegevens>\n</ZKN:genereerDocumentIdentificatie_Di02>\n
      \   </soapenv:Body>\n</soapenv:Envelope>\n"
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate, br
      Connection:
      - keep-alive
      Content-Length:
      - '1347'
      Content-Type:
      - application/soap+xml
      SOAPAction:
      - http://www.egem.nl/StUF/sector/zkn/0310/genereerDocumentIdentificatie_Di02
      User-Agent:
      - python-requests/2.32.4
    method: POST
    uri: http://localhost/stuf-zds
  response:
    body:
      string: "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<soapenv:Envelope xmlns:soapenv=\"http://www.w3.org/2003/05/soap-envelope\">\n
        \   <soapenv:Header/>\n    <soapenv:Body>\n        <ZKN:genereerDocumentIdentificatie_Du02\n
        \               xmlns:StUF=\"http://www.egem.nl/StUF/StUF0301\"\n                xmlns:ZKN=\"http://www.egem.nl/StUF/sector/zkn/0310\">\n
        \           <ZKN:stuurgegevens>\n                <StUF:berichtcode>Du02</StUF:berichtcode>\n
        \               <StUF:zender>\n                    <StUF:organisatie>KING</StUF:organisatie>\n
        \                   <StUF:applicatie>STP</StUF:applicatie>\n                    <StUF:gebruiker/>\n
        \               </StUF:zender>\n                <StUF:ontvanger>\n                    <StUF:organisatie>ORG</StUF:organisatie>\n
        \                   <StUF:applicatie>TTA</StUF:applicatie>\n                    <StUF:gebruiker/>\n
        \               </StUF:ontvanger>\n                <StUF:tijdstipBericht>20210520125731</StUF:tijdstipBericht>\n
        \               <StUF:functie>genereerDocumentidentificatie</StUF:functie>\n
        \           </ZKN:stuurgegevens>\n            <ZKN:melding>melding</ZKN:melding>\n
        \           <ZKN:document StUF:entiteittype=\"EDC\" StUF:functie=\"entiteit\">\n
        \               <ZKN:identificatie>fe715a5be9fd8323</ZKN:identificatie>\n
        \           </ZKN:document>\n        </ZKN:genereerDocumentIdentificatie_Du02>\n
        \   </soapenv:Body>\n</soapenv:Envelope>"
    headers:
      Connection:
      - close
      Content-Length:
      - '1364'
      Content-Type:
      - text/xml
      Date:
      - Tue, 19 Aug 2025 14:11:57 GMT
      Server:
      - Werkzeug/3.1.3 Python/3.12.11
    status:
      code: 200
      message: OK
- request:
    body: "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<soapenv:Envelope\n    xmlns:soapenv=\"http://www.w3.org/2003/05/soap-envelope\"\n
      \   xmlns:StUF=\"http://www.egem.nl/StUF/StUF0301\"\n    xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\n>\n
      \   <soapenv:Header>\n        \n\n    </soapenv:Header>\n    <soapenv:Body>\n
      \       \n\n<ZKN:edcLk01 xmlns:ZKN=\"http://www.egem.nl/StUF/sector/zkn/0310\"
      xmlns:xmime=\"http://www.w3.org/2005/05/xmlmime\">\n    <ZKN:stuurgegevens>\n
      \       <StUF:berichtcode>Lk01</StUF:berichtcode>\n        <StUF:zender>\n    <StUF:organisatie>zender_organisatie-1</StUF:organisatie>\n<StUF:applicatie>zender_applicatie-1</StUF:applicatie>\n<StUF:administratie>zender_administratie-1</StUF:administratie>\n<StUF:gebruiker>zender_gebruiker-1</StUF:gebruiker>\n\n</StUF:zender>\n<StUF:ontvanger>\n
      \   <StUF:organisatie>ontvanger_organisatie-1</StUF:organisatie>\n<StUF:applicatie>ontvanger_applicatie-1</StUF:applicatie>\n<StUF:administratie>ontvanger_administratie-1</StUF:administratie>\n<StUF:gebruiker>ontvanger_gebruiker-1</StUF:gebruiker>\n\n</StUF:ontvanger>\n<StUF:referentienummer>a073bee2-3089-422c-ae3d-6e44b381ffc3</StUF:referentienummer>\n<StUF:tijdstipBericht>20250819141157</StUF:tijdstipBericht>\n\n
      \       <StUF:entiteittype>EDC</StUF:entiteittype>\n    </ZKN:stuurgegevens>\n
      \   <ZKN:parameters>\n        <StUF:mutatiesoort>T</StUF:mutatiesoort>\n        <StUF:indicatorOvername>I</StUF:indicatorOvername>\n
      \   </ZKN:parameters>\n    <ZKN:object StUF:entiteittype=\"EDC\" StUF:verwerkingssoort=\"T\">\n
      \       <ZKN:identificatie>fe715a5be9fd8323</ZKN:identificatie>\n        <ZKN:dct.omschrijving>foo</ZKN:dct.omschrijving>\n
      \       <ZKN:creatiedatum>20250819</ZKN:creatiedatum>\n        <ZKN:ontvangstdatum>20250819</ZKN:ontvangstdatum>\n
      \       <ZKN:titel>inzending</ZKN:titel>\n        <ZKN:beschrijving>Ingezonden
      formulier</ZKN:beschrijving>\n        <ZKN:formaat>application/pdf</ZKN:formaat>\n
      \       <ZKN:taal>nld</ZKN:taal>\n        <ZKN:status>definitief</ZKN:status>\n
      \       <ZKN:verzenddatum>20250819</ZKN:verzenddatum>\n        <ZKN:vertrouwelijkAanduiding>GEHEIM</ZKN:vertrouwelijkAanduiding>\n
      \       <ZKN:auteur>open-forms</ZKN:auteur>\n        <ZKN:inhoud xmime:contentType=\"application/pdf\"
      StUF:bestandsnaam=\"open-forms-inzending.pdf\"></ZKN:inhoud>\n        <StUF:tijdvakGeldigheid>\n
      \           <StUF:beginGeldigheid>20250819</StUF:beginGeldigheid>\n            <StUF:eindGeldigheid
      StUF:noValue=\"geenWaarde\" xsi:nil=\"true\"/>\n        </StUF:tijdvakGeldigheid>\n
      \       <StUF:tijdstipRegistratie>20250819141157</StUF:tijdstipRegistratie>\n
      \       <ZKN:isRelevantVoor StUF:entiteittype=\"EDCZAK\" StUF:verwerkingssoort=\"T\">\n
      \           <ZKN:gerelateerde StUF:entiteittype=\"ZAK\" StUF:verwerkingssoort=\"I\">\n
      \               <ZKN:identificatie>abc999</ZKN:identificatie>\n                <ZKN:omschrijving>my-form</ZKN:omschrijving>\n
      \           </ZKN:gerelateerde>\n            <StUF:tijdstipRegistratie>20250819141157</StUF:tijdstipRegistratie>\n
      \       </ZKN:isRelevantVoor>\n    </ZKN:object>\n</ZKN:edcLk01>\n    </soapenv:Body>\n</soapenv:Envelope>\n"
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate, br
      Connection:
      - keep-alive
      Content-Length:
      - '3029'
      Content-Type:
      - application/soap+xml
      SOAPAction:
      - http://www.egem.nl/StUF/sector/zkn/0310/voegZaakdocumentToe_Lk01
      User-Agent:
      - python-requests/2.32.4
    method: POST
    uri: http://localhost/stuf-zds
  response:
    body:
      string: "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<soapenv:Envelope xmlns:soapenv=\"http://www.w3.org/2003/05/soap-envelope\">\n
        \   <soapenv:Header/>\n    <soapenv:Body>\n        <StUF:Bv03Bericht xmlns:StUF=\"http://www.egem.nl/StUF/StUF0301\"\n
        \                         xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\n
        \                         xsi:schemaLocation=\"http://www.egem.nl/StUF/StUF0301
        stuf0301.xsd\">\n            <StUF:stuurgegevens>\n                <StUF:berichtcode>Bv03</StUF:berichtcode>\n
        \               <StUF:zender>\n                    <StUF:organisatie>KING</StUF:organisatie>\n
        \                   <StUF:applicatie>STP</StUF:applicatie>\n                    <StUF:gebruiker/>\n
        \               </StUF:zender>\n                <StUF:ontvanger>\n                    <StUF:organisatie>ORG</StUF:organisatie>\n
        \                   <StUF:applicatie>TTA</StUF:applicatie>\n                    <StUF:gebruiker/>\n
        \               </StUF:ontvanger>\n                <!-- NOTE: these mock values
        are meaningless -->\n                <StUF:referentienummer>2301189518</StUF:referentienummer>\n
        \               <StUF:tijdstipBericht>20210520125731</StUF:tijdstipBericht>\n
        \               <StUF:crossRefnummer>ea84f068-55e1-43fd-b4a0-94fc18f9b7af</StUF:crossRefnummer>\n
        \           </StUF:stuurgegevens>\n        </StUF:Bv03Bericht>\n    </soapenv:Body>\n</soapenv:Envelope>"
    headers:
      Connection:
      - close
      Content-Length:
      - '1349'
      Content-Type:
      - text/xml
      Date:
      - Tue, 19 Aug 2025 14:11:57 GMT
      Server:
      - Werkzeug/3.1.3 Python/3.12.11
    status:
      code: 200
      message: OK
version: 1
